Hybrid-Memcached-(with-aggre)/ex3_result/memtier_10t_16t_default_datasize_946_cycle_10_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       166561.94          ---          ---         4.79525         4.73500         9.53500        19.83900    160706.25 
Gets          163.23       163.23         0.00         4.75449         4.70300         9.66300        18.04700       160.84 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     166725.17       163.23         0.00         4.79521         4.73500         9.53500        19.83900    160867.09 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       3.215        5.000
SET       3.423       10.000
SET       3.631       15.000
SET       3.903       20.000
SET       4.191       25.000
SET       4.351       30.000
SET       4.479       35.000
SET       4.543       40.000
SET       4.639       45.000
SET       4.735       50.000
SET       4.767       52.500
SET       4.799       55.000
SET       4.863       57.500
SET       4.895       60.000
SET       4.927       62.500
SET       4.991       65.000
SET       5.023       67.500
SET       5.087       70.000
SET       5.119       72.500
SET       5.183       75.000
SET       5.215       76.250
SET       5.247       77.500
SET       5.279       78.750
SET       5.311       80.000
SET       5.375       81.250
SET       5.407       82.500
SET       5.439       83.750
SET       5.503       85.000
SET       5.567       86.250
SET       5.631       87.500
SET       5.663       88.125
SET       5.727       88.750
SET       5.759       89.375
SET       5.823       90.000
SET       5.887       90.625
SET       5.951       91.250
SET       6.047       91.875
SET       6.143       92.500
SET       6.271       93.125
SET       6.431       93.750
SET       6.495       94.062
SET       6.591       94.375
SET       6.687       94.688
SET       6.783       95.000
SET       6.847       95.312
SET       6.943       95.625
SET       7.071       95.938
SET       7.167       96.250
SET       7.295       96.562
SET       7.455       96.875
SET       7.551       97.031
SET       7.647       97.188
SET       7.743       97.344
SET       7.839       97.500
SET       7.967       97.656
SET       8.095       97.812
SET       8.255       97.969
SET       8.383       98.125
SET       8.511       98.281
SET       8.703       98.438
SET       8.767       98.516
SET       8.895       98.594
SET       8.959       98.672
SET       9.087       98.750
SET       9.215       98.828
SET       9.407       98.906
SET       9.535       98.984
SET       9.727       99.062
SET       9.919       99.141
SET      10.111       99.219
SET      10.239       99.258
SET      10.367       99.297
SET      10.495       99.336
SET      10.687       99.375
SET      10.879       99.414
SET      11.135       99.453
SET      11.391       99.492
SET      11.775       99.531
SET      12.159       99.570
SET      12.671       99.609
SET      12.927       99.629
SET      13.247       99.648
SET      13.503       99.668
SET      13.823       99.688
SET      14.207       99.707
SET      14.591       99.727
SET      14.975       99.746
SET      15.423       99.766
SET      15.935       99.785
SET      16.511       99.805
SET      16.767       99.814
SET      17.023       99.824
SET      17.279       99.834
SET      17.663       99.844
SET      17.919       99.854
SET      18.303       99.863
SET      18.687       99.873
SET      19.071       99.883
SET      19.455       99.893
SET      19.839       99.902
SET      20.095       99.907
SET      20.351       99.912
SET      20.607       99.917
SET      20.863       99.922
SET      21.119       99.927
SET      21.375       99.932
SET      21.759       99.937
SET      22.015       99.941
SET      22.399       99.946
SET      22.783       99.951
SET      23.039       99.954
SET      23.167       99.956
SET      23.423       99.958
SET      23.551       99.961
SET      23.807       99.963
SET      24.063       99.966
SET      24.319       99.968
SET      24.575       99.971
SET      24.831       99.973
SET      25.215       99.976
SET      25.471       99.977
SET      25.727       99.978
SET      25.855       99.979
SET      26.111       99.980
SET      26.495       99.982
SET      26.879       99.983
SET      27.519       99.984
SET      28.415       99.985
SET      30.719       99.987
SET      39.167       99.988
SET      51.455       99.988
SET      74.239       99.989
SET      89.087       99.990
SET      92.671       99.990
SET      94.719       99.991
SET     102.911       99.991
SET     107.007       99.992
SET     111.615       99.993
SET     114.687       99.993
SET     117.247       99.994
SET     118.783       99.994
SET     119.807       99.995
SET     120.831       99.995
SET     121.855       99.995
SET     123.391       99.995
SET     124.927       99.996
SET     126.463       99.996
SET     128.511       99.996
SET     130.559       99.997
SET     148.479       99.997
SET     152.575       99.997
SET     155.647       99.997
SET     159.743       99.997
SET     163.839       99.998
SET     169.983       99.998
SET     176.127       99.998
SET     182.271       99.998
SET     374.783       99.998
SET     382.975       99.998
SET     389.119       99.998
SET     395.263       99.999
SET     399.359       99.999
SET     401.407       99.999
SET     407.551       99.999
SET     411.647       99.999
SET     417.791       99.999
SET     421.887       99.999
SET     428.031       99.999
SET     432.127       99.999
SET     438.271       99.999
SET     440.319       99.999
SET     442.367       99.999
SET     446.463       99.999
SET     448.511       99.999
SET     452.607       99.999
SET     454.655       99.999
SET     458.751      100.000
SET     460.799      100.000
SET     462.847      100.000
SET     466.943      100.000
SET     466.943      100.000
SET     468.991      100.000
SET     471.039      100.000
SET     473.087      100.000
SET     475.135      100.000
SET     475.135      100.000
SET     477.183      100.000
SET     479.231      100.000
SET     479.231      100.000
SET     481.279      100.000
SET     483.327      100.000
SET     483.327      100.000
SET     483.327      100.000
SET     485.375      100.000
SET     485.375      100.000
SET     487.423      100.000
SET     487.423      100.000
SET     489.471      100.000
SET     489.471      100.000
SET     491.519      100.000
SET     491.519      100.000
SET     491.519      100.000
[...]
SET     493.567      100.000
SET     495.615      100.000
SET     495.615      100.000
SET     495.615      100.000
[...]
SET     499.711      100.000
SET     499.711      100.000
SET     499.711      100.000
[...]
SET     501.759      100.000
SET     501.759      100.000
SET     503.807      100.000
SET     503.807      100.000
SET     507.903      100.000
SET     507.903      100.000
SET     507.903      100.000
[...]
SET     511.999      100.000
SET     511.999      100.000
SET     511.999      100.000
[...]
SET     518.143      100.000
SET     518.143      100.000
SET     518.143      100.000
[...]
SET     522.239      100.000
SET     522.239      100.000
SET     522.239      100.000
[...]
SET     528.383      100.000
SET     528.383      100.000
---
GET       0.271        0.000
GET       3.199        5.000
GET       3.407       10.000
GET       3.599       15.000
GET       3.855       20.000
GET       4.159       25.000
GET       4.319       30.000
GET       4.415       35.000
GET       4.511       40.000
GET       4.607       45.000
GET       4.703       50.000
GET       4.735       52.500
GET       4.767       55.000
GET       4.799       57.500
GET       4.863       60.000
GET       4.895       62.500
GET       4.927       65.000
GET       4.991       67.500
GET       5.023       70.000
GET       5.087       72.500
GET       5.151       75.000
GET       5.183       76.250
GET       5.215       77.500
GET       5.247       78.750
GET       5.279       80.000
GET       5.311       81.250
GET       5.375       82.500
GET       5.407       83.750
GET       5.439       85.000
GET       5.503       86.250
GET       5.567       87.500
GET       5.599       88.125
GET       5.663       88.750
GET       5.695       89.375
GET       5.759       90.000
GET       5.791       90.625
GET       5.887       91.250
GET       5.983       91.875
GET       6.079       92.500
GET       6.207       93.125
GET       6.367       93.750
GET       6.463       94.062
GET       6.559       94.375
GET       6.655       94.688
GET       6.751       95.000
GET       6.879       95.312
GET       6.975       95.625
GET       7.103       95.938
GET       7.231       96.250
GET       7.359       96.562
GET       7.519       96.875
GET       7.615       97.031
GET       7.679       97.188
GET       7.743       97.344
GET       7.903       97.500
GET       7.967       97.656
GET       8.095       97.812
GET       8.319       97.969
GET       8.447       98.125
GET       8.639       98.281
GET       8.767       98.438
GET       8.895       98.516
GET       8.959       98.594
GET       9.087       98.672
GET       9.151       98.750
GET       9.279       98.828
GET       9.471       98.906
GET       9.663       98.984
GET       9.791       99.062
GET      10.175       99.141
GET      10.431       99.219
GET      10.559       99.258
GET      10.623       99.297
GET      10.751       99.336
GET      11.007       99.375
GET      11.263       99.414
GET      11.519       99.453
GET      11.711       99.492
GET      12.095       99.531
GET      12.479       99.570
GET      13.375       99.609
GET      13.567       99.629
GET      13.759       99.648
GET      14.015       99.668
GET      14.271       99.688
GET      14.591       99.707
GET      15.231       99.727
GET      15.807       99.746
GET      16.127       99.766
GET      16.191       99.785
GET      16.767       99.805
GET      16.895       99.814
GET      17.023       99.824
GET      17.023       99.834
GET      17.151       99.844
GET      17.151       99.854
GET      17.279       99.863
GET      17.407       99.873
GET      17.663       99.883
GET      17.919       99.893
GET      18.431       99.902
GET      18.687       99.907
GET      19.199       99.912
GET      19.199       99.917
GET      19.583       99.922
GET      19.839       99.927
GET      19.967       99.932
GET      19.967       99.937
GET      20.095       99.941
GET      20.607       99.946
GET      20.607       99.951
GET      20.607       99.954
GET      20.735       99.956
GET      20.735       99.958
GET      21.503       99.961
GET      21.503       99.963
GET      22.015       99.966
GET      22.015       99.968
GET      23.423       99.971
GET      23.423       99.973
GET      23.935       99.976
GET      23.935       99.977
GET      23.935       99.978
GET      23.935       99.979
GET      24.319       99.980
GET      24.319       99.982
GET      24.319       99.983
GET      24.319       99.984
GET      24.447       99.985
GET      24.447       99.987
GET      24.447       99.988
GET      24.447       99.988
GET      24.447       99.989
GET      24.447       99.990
GET      91.135       99.990
GET      91.135       99.991
GET      91.135       99.991
GET      91.135       99.992
GET      91.135       99.993
GET      91.135       99.993
GET      91.135       99.994
GET      91.135       99.994
GET      91.135       99.995
GET      91.135       99.995
GET     107.007       99.995
GET     107.007      100.000
---
WAIT      0.000      100.000